{
    "topics": [
        { "id": 1, "title": "Introdução", "description": "Sejam bem vindos estágiarios ao Starcather" },
        { "id": 2, "title": "Git", "description": "Um sistema de controle de versão amplamente utilizado para rastrear as alterações no código-fonte durante o desenvolvimento de software, permitindo o trabalho colaborativo e a gestão eficiente de projetos." },
        { "id": 3, "title": "HTML 5, CSS 3", "description": "Linguagens essenciais para o desenvolvimento web. HTML 5 é a linguagem de marcação padrão para criar e estruturar conteúdo na web, enquanto CSS 3 é utilizada para estilizar e projetar esse conteúdo." },
        { "id": 4, "title": "JavaScript (EcmaScript)", "description": "Uma linguagem de programação amplamente utilizada para desenvolvimento web. EcmaScript é o padrão no qual o JavaScript é baseado e é constantemente atualizado com novos recursos e funcionalidades." },
        { "id": 5, "title": "Docker, Docker Compose", "description": "Plataformas de virtualização de contêineres que permitem empacotar, distribuir e executar aplicativos em ambientes isolados, garantindo portabilidade e consistência de ambientes de desenvolvimento e produção." },
        { "id": 6, "title": "Bancos de dados relacionais (SQL)", "description": "Sistemas de gerenciamento de banco de dados que organizam dados em tabelas relacionadas. SQL (Structured Query Language) é a linguagem padrão para manipulação e consulta de dados em bancos de dados relacionais." },
        { "id": 7, "title": "PHP (composer, xdebug, PDO)", "description": "Uma linguagem de script amplamente utilizada para desenvolvimento web do lado do servidor. O Composer é um gerenciador de dependências para PHP, Xdebug é uma ferramenta de depuração e o PDO (PHP Data Objects) é uma interface para acessar bancos de dados em PHP." },
        { "id": 8, "title": "SOLID", "description": "Um acrônimo que representa cinco princípios de design de software (Single Responsibility, Open/Closed, Liskov Substitution, Interface Segregation, Dependency Inversion), destinados a criar sistemas mais fáceis de entender, manter e estender." },
        { "id": 9, "title": "Arquitetura de Software (MVC, Domain-centric)", "description": "Abordagens para organizar e estruturar sistemas de software. MVC (Model-View-Controller) é um padrão de arquitetura comumente usado em desenvolvimento web, enquanto a arquitetura centrada no domínio (Domain-centric) enfoca a estruturação do software em torno dos conceitos e processos do domínio de negócios." },
        { "id": 10, "title": "Laravel (Criação de API's, Eloquent)", "description": "Um framework de desenvolvimento web em PHP conhecido por sua elegância e facilidade de uso. O Laravel facilita a criação de APIs e fornece o Eloquent ORM para interagir com bancos de dados de forma expressiva." },
        { "id": 11, "title": "Node", "description": "Uma plataforma de desenvolvimento de aplicações de código aberto que permite a execução de código JavaScript do lado do servidor. Amplamente utilizado para construir aplicativos de rede escaláveis e rápidos." },
        { "id": 12, "title": "Sass", "description": "Uma linguagem de folha de estilo que estende o CSS com características como variáveis, aninhamento e mixins. Ajuda a tornar o código CSS mais modular e fácil de manter." },
        { "id": 13, "title": "Tailwind", "description": "Um framework de CSS utilitário que fornece classes prontas para uso para estilizar elementos HTML de forma rápida e consistente. Favorece uma abordagem de estilo utility-first." },
        { "id": 14, "title": "Typescript", "description": "Um superset de JavaScript que adiciona tipagem estática opcional e outras características à linguagem. Torna o código JavaScript mais seguro, escalável e fácil de manter." },
        { "id": 15, "title": "Código Limpo (Princípios)", "description": "Conjunto de princípios e práticas para escrever código de alta qualidade, fácil de entender e manter. Inclui princípios como \"Don't Repeat Yourself\" (DRY), \"Keep It Simple, Stupid\" (KISS), entre outros." },
        { "id": 16, "title": "Testes Unitários", "description": "Uma prática de desenvolvimento de software em que unidades individuais de código são testadas de forma isolada para garantir que funcionem conforme o esperado." },
        { "id": 17, "title": "Testes de integração", "description": "Testes que verificam se os diferentes componentes de um sistema funcionam corretamente juntos. Eles testam a integração entre unidades de código, módulos ou sistemas." },
        { "id": 18, "title": ".NET (Entity Framework, ASP.NET)", "description": "Um framework de desenvolvimento de software da Microsoft que suporta várias linguagens de programação. O Entity Framework é uma ORM (Object-Relational Mapping) para .NET, enquanto o ASP.NET é um framework para construir aplicativos web." },
        { "id": 19, "title": "Java Spring Boot (Spring Data, Spring Web MVC)", "description": "Um framework de desenvolvimento de aplicações Java que simplifica o desenvolvimento de aplicativos empresariais. Spring Data facilita o acesso a dados em bancos de dados, enquanto Spring Web MVC é um framework para construir aplicativos web em Java." },
        { "id": 20, "title": "React js", "description": "Uma biblioteca JavaScript para construir interfaces de usuário interativas e dinâmicas. Desenvolvida pelo Facebook, é amplamente utilizada para criar aplicativos web de página única (SPAs)." },
        { "id": 21, "title": "React native (Puro)", "description": "Um framework JavaScript para construir aplicativos móveis nativos para iOS e Android usando React. Permite o desenvolvimento de aplicativos móveis usando uma única base de código JavaScript." },
        { "id": 22, "title": "Vue.js (Vite, SPA)", "description": "Um framework progressivo de JavaScript para construir interfaces de usuário. Vite é uma ferramenta de compilação para Vue.js, enquanto SPA (Single Page Application) refere-se a aplicativos web que carregam uma única página HTML e atualizam dinamicamente conforme o usuário interage com o aplicativo." },
        { "id": 23, "title": "Android (Java, Kotlin)", "description": "Um sistema operacional móvel desenvolvido pelo Google. Java e Kotlin são as principais linguagens de programação usadas para desenvolver aplicativos Android." },
        { "id": 24, "title": "GraphQL", "description": "Uma linguagem de consulta para APIs e um tempo de execução para executar essas consultas com seus respectivos servidores. Oferece uma abordagem mais eficiente e flexível para buscar e manipular dados em comparação com REST." },
        { "id": 25, "title": "Microserviços", "description": "Uma arquitetura de desenvolvimento de software que estrutura uma aplicação como um conjunto de serviços independentes e pequenos, cada um executando um processo de negócio específico." },
        { "id": 26, "title": "Escalabilidade horizontal", "description": "O processo de aumentar a capacidade de um sistema adicionando mais máquinas ao invés de aumentar a capacidade de uma única máquina. É comum em ambientes de nuvem e é importante para lidar com aumentos repentinos no tráfego." },
        { "id": 27, "title": "Kafka", "description": "Uma plataforma de streaming distribuída que é usada para construir sistemas de pipelines de dados em tempo real e aplicativos de processamento de dados em tempo real. É escalável, tolerante a falhas e altamente disponível." }
    ]
}
